<?php
	// список городов составил "от балды" примера ради.
	// по идее, можно было обратиться к какому-нибудь ресурсу в Инете со списком всех городов (кажется, есть такой)
	$alphabet;
	$alphabet[0] = "А";
	$alphabet[1] = "Б";
	$alphabet[2] = "В";
	$alphabet[3] = "Г";
	$alphabet[4] = "Д";

	$cities;
	$cities["А"][0]="Анапа";
	$cities["А"][1]="Азов";
	$cities["А"][2]="Астрахань";
	
	$cities["Б"][0]="Барабинск";
	$cities["Б"][1]="Барнаул";
	$cities["Б"][2]="Белгород";
	
	$cities["В"][0]="Великий Устюг";
	$cities["В"][1]="Владивосток";
	$cities["В"][2]="Волоколамск";
	
	$cities["Г"][0]="Геленджик";
	$cities["Г"][1]="Горно-Алтайск";
	$cities["Г"][2]="Грозный";
	
	$cities["Д"][0]="Домодедово";
	$cities["Д"][1]="Донецк";
	$cities["Д"][2]="Дрезна";
?>